HW05/hw-acceptance-unit-test-cycle/rottenpotatoes/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 7]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]
---
  def find_same_director
    movie = Movie.find(params[:id])
    if movie.director.blank?

UPDATE "movies" SET "director" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["director", "Ridley Scott"], ["updated_at", "2017-08-10 20:04:59.986459"], ["id", 3]]
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)